)ATTR DEFAULT(%+~)
   ~  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   %  TYPE(TEXT)    INTENS(HIGH) SKIP(ON)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
   ^  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(RED)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFRPTS - RACF Reports - 1 of 2+)\-\%Tutorial
%Command ===>~ZCMD
+
%Reports+will create RACF reports via a batch job using:
!  -+IBM's DFSORT ICETOOL using IRRDBU00 unload dataset
!  -+IBM's Data Security Monitor (DSMON)
+
+Report!Names+starting with the following characters where obtained from:
%  $+and%@!...+IBM's!SYS1.SAMPLIB(IRRICE)
%  #!.........^https://www.ibm.com/support/pages/dfsortmvs-downloads
%  #ICE!......^https//oocities.org/steveneeland/Sort_Reports.html
+
+IBM's!Define JOB card+panel will be displayed when:
!  -+Selecting a report and the variable!ZLLGJOB1+is empty or contains
+    the default value of!//USERID   JOB (ACCOUNT),'NAME'
!  -+Typing in%JOB+on the primary command line
+
+The!IRRDBU00 Dataset+can and the temporary dataset's UNIT/SPACE parameters
+can be defined for all users by updating panel members!$DEFSETG+or!$DEFSITE
+
+
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACRPT1
  &ZCONT   = #RACRPT2
)END
