)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Settings - 3 of 3+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
+Adding TSO userid:
!  Default password +The initial password given to a new TSO user or when
+                    resetting an individual's password%(Option 5 and line
+                   %command PW).+ The password can be in upper/lower case and
+                    if left%blank,+will produce a%random+password (default)
+
!  User catalog     +The TSO user catalog to define all new TSO user aliases
+
!  ISPPROF dataset  +The name of the TSO profile
+
!  User dataset     +The PDS dataset to be allocated for a new TSO user
+                    (optional)
+
+
+
+
+
+
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACSET1
)END
