)ATTR DEFAULT(%+_)
  _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
  ! TYPE(TEXT)  INTENS(LOW)  SKIP(ON) COLOR(TURQ)
  + TYPE(TEXT)  INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Settings - 2 of 2+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
+General:
!  RACF commands   +Enter%Yes+to view each RACF command before it is
+                  +issued,%No+to hide all RACF commands (default)
+
!  REXX trace      +Enter%Yes+to trace the execution of the REXX exec,
+                  %No+to work without trace (default)
+
+Adding TSO userid:
!  User catalog    +Specify the TSO user catalog in which all new TSO user
+                  +aliases are to be defined
+
!  ISPPROF dataset +Specify the name of the TSO profile
+
!  JOBLIB dataset  +Specify an initial job library to be allocated
+                  +for new TSO users
+
+
+
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACPRM1
  &ZCONT   = #RACPRM1
)END
