)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Settings - 2 of 3+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
+General:
!  Confirm panel   +Specify whether each modify operation must be confirmed
+
!  RACF commands   +To view the RACF commands executed, type in the following:
+                     %Display+in pop-up panel
+                     %Log+to the ISPF Log file
+                     %Both+in a pop-up panel and the ISPF Log file
+                     %No+do not display/log (default)
+
!  REXX trace      +Allow tracing REXX programs
+                     %Labels,+display only executed subroutines/labels
+                     %Results,+display all commands and results
+                     %No,+turn off tracing (default)
+
+Adding TSO userid:
!  User catalog    +The TSO user catalog to define all new TSO user aliases
+
!  ISPPROF dataset +The name of the TSO profile
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZCONT   = #RACPRM3
)END
