)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Settings - 2 of 3+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
+General:
!  Confirm panel    +Specify whether each modify operation must be confirmed
+
!  RACF commands    +To view the RACF commands executed, type in the following:
+                     %Display+in pop-up panel
+                     %Log+to the ISPF Log file
+                     %Both+in a pop-up panel and the ISPF Log file
+                     %No+do not display/log (default)
+
!  REXX trace       +Allow tracing REXX programs
+                     %Labels,+display programs/subroutines/labels
+                     %Programs,+display REXX program names
+                     %Results,+display commands and results
+                     %No,+turn off tracing (default)
+
+
+
+
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZCONT   = #RACSET3
)END
