)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Group Profiles+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
+Primary Commands
%  Sort column A/D +Sort a column, in ascending or descending order
+                  +(Column headers are point-and-shoot sort fields)
%  Locate text     +Locate text in the sorted column
%  Only text       +Only display rows with text string
%  Reset text      +Redisplay rows and pass a new search filter (optional)
+
+Line Commands
%  S  !Show        +List of users connected to the group
%  L  !List        +Issue LISTGROUP command
%  P  !Profile     +List group profile using IRRXUTIL (admin)
%  C  !Change      +Change group attributes (admin)
%  A  !Add         +Define a new group (admin)
%  R  !Remove      +Remove group from RACF (admin)
)PROC
  &ZUP     = #RACGRP8
)END
