)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Password Reset+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
+ %Password+will display a pop-up panel, allowing to quickly change
+  an individuals password and/or!RESUME+their userid.
+
+  This utility will generate a!random+password for each userid.
)PROC
  &ZUP     = #RACPSWD
)END
