)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   %  TYPE(TEXT)    INTENS(HIGH) SKIP(ON)
   ¨  AREA(DYNAMIC) EXTEND(OFF)
   ®  TYPE(DATAOUT) INTENS(LOW)  COLOR(GREEN)
   ›  TYPE(DATAOUT) INTENS(low)  COLOR(TURQ)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - RACF Messages+)\-\%Tutorial
%Command ===>_ZCMD
+
%Messages+will scan the active or backup¨DATAFLD1                             ¨
!INSUFFICIENT ACCESS+and!VIOLATIONS+messages in foreground or batch
+
+It uses!SDSF+to obtain the active¨DATAFLD2                                   ¨
+authorized to view the!SDSF LOG
+
+The search criteria can be userid, lpar, date, only USS messages and type
+of!ICH408I+message (insufficient access or violations)
+
+A small message in the upper right hand corner of the screen will display
+the total number of!ICH408I+messages found
+
+The!Backup dataset+name can be:
!  -+An absolute, relative or base GDG
!    --+When it is a base GDG, it will use the generation with a create date
+       of minus 1, due to the backup was taken after midnight
!  -+Defined for all users by updating the panel members%$DEFSETG+or%$DEFSITE
+
+A!Job card+must be supplied when executing in batch mode
)INIT
  VGET (SETGSLOG ZUSER)
  &DATAFLD1 = '›&SETGSLOG®datasets for›ICH408I'
  &DATAFLD2 = '›&SETGSLOG®and userid›&ZUSER®must be'
)PROC
  &ZUP     = #RACMSG
)END
