)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   @  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(RED)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Notes+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
!  1)+The REXX program%RACFADM+is used to invoke the RACF Administration
+     dialog. It allocates the neccessary files using!ISPF LIBDEF+and
+    !TSO ALTLIB+commands
+
!  2)+Installing a new version/release of%RACFADM,+suggest!backuping+
+     current datasets,!deleting+the members and!copying+in the new
+     version/release
!     -+Past releases, modules have been renamed or deleted
!     -+Prevents from having dead modules in datasets
+
!  3)+To use the line command%'P'rofile,+which executes!IRRXUTIL+(RACF
+     Administration API), the following authorization will need to be
+     granted using!RACF RDEFINE+and!PERMIT+commands
+
+      @RDEFINE FACILITY (IRR.RADMIN.*) OWNER(SYS1) UACC(READ)
+      @        AUDIT(FAILURES(READ)) DATA('RACF ADMINISTRATION API')
+      @        WARNING
+
+      @PERMIT IRR.RADMIN.* CLASS(FACILITY) ID(group) GEN
)PROC
  &ZUP     = #RACMENU
)END
