)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - RACF Parameters+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
+ %RACFprms+reads the!Access Control Communication Vector Table (CVTRAC)
+  in memory and displays RACF information, such as the version, database
+  name and other security parameters.
+
+  Some of the RACF parameters displayed are:
!    JES2 parameters
!    Password options
!    Setropt options
!    DASD options
!    Tape options
!    Model options
!    Terminal options
!    Statistics
!    Audit options
)PROC
  &ZUP     = #RACPRMS
)END
