)ATTR DEFAULT(%+~)
   ~  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Publications+)\-\%Tutorial
%Command ===>~ZCMD
+
+ Below are websites to%RACF educational+documents, cut and paste the
+ URL into a browser.
+
!   RACF for Dummies, Mark Wilson, RSM
+     https://tinyurl.com/ugpr9tm
+
!   RACF The basics, Rui Miguel Feio, RSM
+     https://www.slideshare.net/rmfeio/racf-the-basics-v12
+
!   Introduction to RACF, Robert Hansel, RSH
+     https://www.rshconsulting.com/RSHpres/
+         RSH_Consulting__Introduction_to_RACF__May_2019.pdf
+
!   Security on z/OS, IBM
+     https://wwwlgis.informatik.uni-kl.de/cms/fileadmin/users/kschmidt/
+           mainframe/lutzkuehner/Chapter11_Security_on_zOS_slides.pdf
+
+
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACPUBL
)END
