)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT)   HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Password Reset+)\-\%Tutorial
%Command ===>_ZCMD
%
+ %Password+will display a pop-up panel, allowing to quickly change
+  an individual's password and/or!RESUME+their userid.
+
+  This utility will use the!'Initial Password'+defined in%Settings
+  (Option 0) and if the field is!blank,+it will generate a!random+
+  password in upper and lower case characters.
)PROC
  &ZUP     = #RACPSWD
)END
