)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Enqueues+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
+ %Enqueues+displays the datasets allocated via%LIBDEF/ALTLIB+used
+  to invoke%RACFADM+and any jobs/stcs/users with enqueues on these
+  datasets.
+
+  This will provide insight to who and when they are using the
+  utility.  Assisting in planning when to rollout/implement changes
+  to this utility, without impacting anyone.
)PROC
  &ZUP     = #RACENQ
)END
