)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT)   HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   @  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(RED)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Installation Notes - 1 of 3+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
!  1)+The REXX program%RACFADM+is used to invoke the RACF Administration
+     dialog.  It allocates the necessary files using!ISPF LIBDEF+and
+    !TSO ALTLIB+commands
+
!  2)+Installing a new version of%RACFADM,+suggest!backing up+current datasets,
+    !deleting+the members and!copying+in the new version, due to:
!       -+Members may be renamed or deleted
!       -+Prevents from having dead/unused members
+
!  3)+The default%Settings+(Option 0) for new users is defined in member
+    %$DEFSETG+in the panel dataset.  To override these settings, create a
+     member called%$DEFSITE+and define/set any of the variables
!     *+This will prevent from having to update the $DEFSETG member everytime
*       a new version of RACFADM is installed
!     *+The user's%Settings+are saved in their!ISPF+profile dataset in member
+      %RADMPROF+
+
+
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACNOT1
  &ZCONT   = #RACNOT2
)END
