)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT)   HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   @  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(RED)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Installation Notes - 2 of 2+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
!  6)+The%User+line command%XR,+Cross Reference Report, is not displayed
!       -+Reason for this is sites with a large RACF database, the time
+         for!IRRUT100+to read/obtain the data is significant
!       -+To access/use this command, turn on the%Settings+(Option 0):
+          !Administrator ..... Y
+
!  7)+To use the line command%Profile,+the following will need to be
+     accomplished:
!       -+Turn on the%Settings+(Option 0)
+          !Admin RACF API .... Y
!       -+Obtain authorization to the following resources, by executing
+        !RACF RDEFINE+and!PERMIT+commands:
+          @RDEFINE FACILITY (IRR.RADMIN.*) OWNER(SYS1) UACC(READ)
+          @        AUDIT(FAILURES(READ)) DATA('RACF ADMINISTRATION API')
+          @        WARNING
+          @PERMIT IRR.RADMIN.* CLASS(FACILITY) ID(group) GEN
+
+
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACNOT1
)END
