)ATTR DEFAULT(%+_)
   _  TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) HILITE(USCORE)
   !  TYPE(TEXT)  INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)  INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Settings - 2 of 3+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
+General:
!  Confirm panel   +Specify whether each modify operation must be confirmed
+
!  RACF commands   +To view the RACF commands executed, type in the following:
+                     %Display+in pop-up panel
+                     %Log+to the ISPF Log file
+                     %Both+in a pop-up panel and the ISPF Log file
+                     %No+do not display/log (default)
+
!  REXX trace      %Yes+to trace the execution of REXX programs and
+                  %No+to not display trace data (default)
+
+Adding TSO userid:
!  User catalog    +The TSO user catalog to define all new TSO user aliases
+
!  ISPPROF dataset +The name of the TSO profile
+
!  JOBLIB dataset  +The job library to be allocated for new TSO users
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACPRM1
)END
