)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT)   HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
   $  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN) hilite(uscore)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - OMVS ORALTER - 1 of 2+)\-\%Tutorial
%Command ===>_ZCMD
%
%ORALTER+provides UNIX Security Attribute Management using a syntax similiar
+to the RACF!RALTER+command
+
%Required:+Path and Operands
+
%Operands:!APF | NOAPF
!          AUDIT(access-attempt(audit-access-level))
!          DEBUG
!          GLOBALaudit(access-attempt(audit-access-level))
!          GROUP(group-name)
!          OUTFILE(path-name)
!          OWNER(user-ID)
!          PERMS(uuugggooo)
!          PROGRAM | NOPROGRAM
!          RECursive(ALL |$CURRENT!| FILESYS)
!          SECLABEL(seclabel-name)
!          SETGID | NOSETGID    SETUID | NOSETUID    STICKY | NOSTICKY
!          VERBOSE
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACOMA1
  &ZCONT   = #RACOMA2
)END
