)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT)   HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - Settings - 4 of 4+)\-\%Tutorial
%Command ===>_ZCMD                                                             +
%
+Adding TSO userid
!  User catalog     +The TSO user catalog to define all new TSO user aliases
+
!  ISPPROF dataset  +The name of the TSO profile
+
!  User dataset     +The PDS dataset to be allocated for a new TSO user
+                    (optional)
+
+
+
+
+
+
+
+
+
+
+
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACSET1
)END
