)ATTR DEFAULT(%+_)
  _ TYPE(INPUT)  INTENS(HIGH) CAPS(ON)   JUST(LEFT)   HILITE(USCORE)
  $ TYPE(OUTPUT) INTENS(LOW)  JUST(LEFT) COLOR(TURQ) CAPS(OFF)
  + TYPE(TEXT)   INTENS(LOW)  SKIP(ON)   COLOR(GREEN)
)BODY WINDOW(64,12) EXPAND(\\)
%Command ===>_ZCMD

 $msg1
 $msg2
 $msg3
 $msg3A
 $msg3B
 $msg3C

 $msg4

+\ \+Press%ENTER+to continue\ \
)END
