)ATTR DEFAULT(%+_)
  _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)   HILITE(USCORE)
  { TYPE(TEXT)  INTENS(LOW)  SKIP(ON) COLOR(BLUE)
  } TYPE(TEXT)  INTENS(LOW)  SKIP(ON) COLOR(RED)
  + TYPE(TEXT)  INTENS(LOW)  SKIP(ON) COLOR(GREEN)
  ~ TYPE(TEXT)  INTENS(LOW)  SKIP(ON) COLOR(TURQ)
)BODY EXPAND(\\)
+\-\(%RACFADM - Settings+)\-\
%Command ===>_ZCMD                                                             +
%
%General:
+  Administrator{......_Z~    (Y=Yes, N=No)            {Administrator authority
+  Default filter{....._Z                             { Default search string
+  Status interval{...._Z   ~ (0-9999)                 {Progress message number
+  Display files{......_Z~    (B=Browse, E=Edit, V=View)
+  Confirm panel{......_Z~    (Y=Yes, N=No)            {Confirm command request
+  RACF commands{......_Z~    (Y=Yes, N=No)            {Show RACF commands
+  REXX trace{........._Z~    (Y=Yes, N=No)            {Start REXX trace
+
%Adding TSO userids:
+  User catalog{......._Z                             { z/OS alias catalog
+  ISPPROF dataset{...._Z                             { TSO ISPF profile
+  JOBLIB dataset{....._Z                             { TSO programmer library
)INIT
  VGET (ERAADMN ERAFLTR ERASINT ERADISP ERACONF ERASHOW ERATRACE +
        ERACTLG ERAISPP ERAULIB) PROFILE
  &ERAADMN  = TRANS (&ERAADMN  YES,Y NO,N *,*)
  &ERACONF  = TRANS (&ERACONF  YES,Y NO,N *,*)
  &ERASHOW  = TRANS (&ERASHOW  YES,Y NO,N *,*)
  &ERADISP  = TRANS (&ERADISP  BROWSE,B EDIT,E VIEW,V *,*)
  &ERATRACE = TRANS (&ERATRACE YES,Y NO,N *,*)
  .ZVARS = '(ERAADMN  ERAFLTR ERASINT ERADISP ERACONF ERASHOW +
             ERATRACE ERACTLG ERAISPP ERAULIB)'
  .HELP   = #RACPRM1
  .CURSOR = ERAADMN
)PROC
  &ERAADMN  = TRANS (&ERAADMN  Y,YES, N,NO *,*)
  &ERACONF  = TRANS (&ERACONF  Y,YES, N,NO *,*)
  &ERASHOW  = TRANS (&ERASHOW  Y,YES, N,NO *,*)
  &ERADISP  = TRANS (&ERADISP  B,BROWSE E,EDIT V,VIEW *,*)
  &ERATRACE = TRANS (&ERATRACE Y,YES, N,NO *,*)
  VER  (&ERAADMN,NB,LIST,NO,YES)
  VER  (&ERASINT,NB,RANGE,0,9999)
  VER  (&ERADISP,NB,LIST,BROWSE,EDIT,VIEW)
  VER  (&ERACONF,NB,LIST,NO,YES)
  VER  (&ERASHOW,NB,LIST,NO,YES)
  VER  (&ERATRACE,NB,LIST,NO,YES)
  IF (&ERACTLG NE ' ')
     VER (&ERAULIB,NB)
     VER (&ERAISPP,NB)
  VPUT (ERAADMN ERAFLTR ERASINT ERADISP ERACONF ERASHOW ERATRACE +
        ERACTLG ERAISPP ERAULIB) PROFILE
)END
