)ATTR DEFAULT(%+_)
   %  TYPE(TEXT)   INTENS(HIGH) COLOR(WHITE) SKIP(ON)
   +  TYPE(TEXT)   INTENS(LOW)  COLOR(GREEN) SKIP(ON)
   _  TYPE(INPUT)  INTENS(HIGH) COLOR(RED)   CAPS(ON) HILITE(USCORE)
)BODY WINDOW(61,12)
+
%Cmd=>_ZCMD
+
+   Insert PDS/member name or sequential file name:
+
+   PDS/Seq =_RACFSDSN                                    +
+   Member  =_RACFSMBR+
+
+   Replace =_Z+ (Y/N)
+
+     ENTER%=+PROCESS                          PF3%=+END
+
)INIT
  &ZCMD    = ' '
  &ZWINTTL = 'RACFADM - Save to DSN'
  .ZVARS   = '(RACFSREP)'
  .CURSOR  = RACFSDSN
  .HELP    = #RACMENU
)PROC
  &LEN = LENGTH(RACFSDSN)
  IF (&LEN < 43)
     VER (&RACFSDSN,NB,DSNAME)
  ELSE
     VER (&RACFSDSN,NB)
  VER (&RACFSMBR,NAME)
  VER (&RACFSREP,NB,LIST,Y,N)
)END
