)CM*------------------------------------------------------------------*
)CM*  Purpose:  RACFADM - RACF Reports - Unload RACF Database
)CM*------------------------------------------------------------------*
)CM*  FLG  YYMMDD  USERID   DESCRIPTION
)CM*  ---  ------  -------  ------------------------------------------
)CM*  @A1  200618  RACFA    Removed JOB card, moved to seperate member
)CM*  @A0  200617  RACFA    Created skeleton
)CM*------------------------------------------------------------------*
)DEFAULT  )&#!~|@
//*-------------------------------------------------------------------*
//*  PURPOSE:  UNLOAD RACF DATABASE
//*-------------------------------------------------------------------*
//*  NOTES:    1) RACF DATABASES:
//*                 PRIMARY .. &RACFDPRM
//*                 BACKUP ... &RACFDBKP
//*            2) MAY NEED TO CHANGE INDD1 AND OUTDD DATASET NAMES
//*-------------------------------------------------------------------*
//DELETE   EXEC  PGM=IEFBR14
//UNLOAD   DD  DSN=&SETDRPTU,
//             DISP=(MOD,DELETE,DELETE),
//             UNIT=SYSALLDA,SPACE=(TRK,0)
//*-------------------------------------------------------------------*
//IRRDBU00 EXEC PGM=IRRDBU00,PARM=NOLOCKINPUT
//INDD1    DD  DISP=SHR,DSN=&RACFDTMP
//OUTDD    DD  DSN=&SETDRPTU,
//             DISP=(NEW,CATLG,DELETE),
//             DCB=(LRECL=4096,RECFM=VB,BLKSIZE=81920),
//             UNIT=SYSALLDA,SPACE=(CYL,(300,300),RLSE)
//SYSPRINT DD  SYSOUT=*
